app/Controllers/AdminDashboard.php

    public function pendingLoans()
{
    $db = \Config\Database::connect();

    $qard = $db->table('qard')
    ->join('anggota', 'anggota.id_anggota = qard.id_anggota')
    ->where('qard.status', 'pending')
    ->select('qard.id_qard AS id, qard.id_anggota, anggota.nama_lengkap, anggota.nomor_anggota, qard.tanggal, qard.jml_pinjam, qard.status, "qard" as jenis')
    ->get()->getResultArray();

    $murabahah = $db->table('murabahah')
        ->join('anggota', 'anggota.id_anggota = murabahah.id_anggota')
        ->where('murabahah.status', 'pending')
        ->select('murabahah.id_mr AS id, murabahah.id_anggota, anggota.nama_lengkap, anggota.nomor_anggota, murabahah.tanggal, murabahah.jml_pinjam, murabahah.status, "murabahah" as jenis')
        ->get()->getResultArray();

    $mudharabah = $db->table('mudharabah')
        ->join('anggota', 'anggota.id_anggota = mudharabah.id_anggota')
        ->where('mudharabah.status', 'pending')
        ->select('mudharabah.id_md AS id, mudharabah.id_anggota, anggota.nama_lengkap, anggota.nomor_anggota, mudharabah.tanggal, mudharabah.jml_pinjam, mudharabah.status, "mudharabah" as jenis')
        ->get()->getResultArray();
---
SELECT `qard`.`id_qard` AS `id`, `qard`.`id_anggota`, `anggota`.`nama_lengkap`, `anggota`.`nomor_anggota`, `qard`.`tanggal`, `qard`.`jml_pinjam`, `qard`.`status`, "qard" as `jenis`
FROM `qard`
JOIN `anggota` ON `anggota`.`id_anggota` = `qard`.`id_anggota`
WHERE `qard`.`status` = 'pending'
SELECT `mudharabah`.`id_md` AS `id`, `mudharabah`.`id_anggota`, `anggota`.`nama_lengkap`, `anggota`.`nomor_anggota`, `mudharabah`.`tanggal`, `mudharabah`.`jml_pinjam`, `mudharabah`.`status`, "mudharabah" as `jenis`
FROM `mudharabah`
JOIN `anggota` ON `anggota`.`id_anggota` = `mudharabah`.`id_anggota`
WHERE `mudharabah`.`status` = 'pending'
SELECT `murabahah`.`id_mr` AS `id`, `murabahah`.`id_anggota`, `anggota`.`nama_lengkap`, `anggota`.`nomor_anggota`, `murabahah`.`tanggal`, `murabahah`.`jml_pinjam`, `murabahah`.`status`, "murabahah" as `jenis`
FROM `murabahah`
JOIN `anggota` ON `anggota`.`id_anggota` = `murabahah`.`id_anggota`
WHERE `murabahah`.`status` = 'pending'

    public function searchAnggota()
{
    $search = $this->request->getGet('q');
    $builder = $this->anggotaModel;

    if ($search) {
        $builder = $builder->like('nama_lengkap', $search)
                           ->orLike('no_ktp', $search);
    }
    $anggota = $builder->findAll(10);

    $userModel = new \App\Models\UserModel();
    $users = $userModel->findAll();
---
SELECT *
FROM `anggota`
WHERE `nama_lengkap` LIKE '%mi%' ESCAPE '!'
OR  `no_ktp` LIKE '%mi%' ESCAPE '!'
 LIMIT 10
SELECT *
FROM `users`

    public function index()
{
    $db = \Config\Database::connect();

    // =========================
    // Hitung Total Anggota Aktif
    // =========================
    $totalAnggota = $db->table('anggota')
        ->where('status', 'aktif')
        ->countAllResults();

    // =========================
    // Hitung Total Simpanan
    // =========================
    $totalSimpananPokok = $db->table('simpanan_pokok')
        ->where('status', 'aktif')
        ->selectSum('jumlah')
        ->get()->getRow()->jumlah ?? 0;

    $totalSimpananWajib = $db->table('simpanan_wajib')
        ->where('status', 'aktif')
        ->selectSum('jumlah')
        ->get()->getRow()->jumlah ?? 0;

    $totalSimpananSukarela = $db->table('simpanan_sukarela')
        ->where('status', 'aktif')
        ->selectSum('jumlah')
        ->get()->getRow()->jumlah ?? 0;
---
SELECT COUNT(*) AS `numrows`
FROM `anggota`
WHERE `status` = 'aktif'
SELECT SUM(`jumlah`) AS `jumlah`
FROM `simpanan_pokok`
WHERE `status` = 'aktif'
SELECT SUM(`jumlah`) AS `jumlah`
FROM `simpanan_wajib`
WHERE `status` = 'aktif'
SELECT SUM(`jumlah`) AS `jumlah`
FROM `simpanan_pokok`
WHERE `status` IN ('aktif','lunas')
SELECT SUM(`jumlah`) AS `jumlah`
FROM `simpanan_sukarela`
WHERE `status` = 'aktif'
SELECT SUM(`jumlah`) AS `jumlah`
FROM `simpanan_wajib`
WHERE `status` IN ('aktif','lunas')


    // =========================
    // Hitung Pembiayaan Berjalan
    // =========================
    $totalQard = $db->table('qard')
        ->where('status', 'aktif')
        ->selectSum('jml_pinjam')
        ->get()->getRow()->jml_pinjam ?? 0;

    $totalMurabahah = $db->table('murabahah')
        ->where('status', 'aktif')
        ->selectSum('jml_pinjam')
        ->get()->getRow()->jml_pinjam ?? 0;

    $totalMudharabah = $db->table('mudharabah')
        ->where('status', 'aktif')
        ->selectSum('jml_pinjam')
        ->get()->getRow()->jml_pinjam ?? 0;
---
SELECT SUM(`jml_pinjam`) AS `jml_pinjam`
FROM `qard`
WHERE `status` = 'aktif'
SELECT SUM(`jml_pinjam`) AS `jml_pinjam`
FROM `murabahah`
WHERE `status` = 'aktif'
SELECT SUM(`jml_pinjam`) AS `jml_pinjam`
FROM `mudharabah`
WHERE `status` = 'aktif'

    $bulanIni = date('m');
    $tahunIni = date('Y');

    $marginQard = $db->table('qard')
        ->where('status', 'aktif')
        ->where('MONTH(tanggal)', $bulanIni)
        ->where('YEAR(tanggal)', $tahunIni)
        ->selectSum('jml_terbayar')
        ->get()->getRow()->jumlah ?? 0;

    $marginMurabahah = $db->table('murabahah')
        ->where('status', 'aktif')
        ->where('MONTH(tanggal)', $bulanIni)
        ->where('YEAR(tanggal)', $tahunIni)
        ->selectSum('jml_terbayar')
        ->get()->getRow()->jumlah ?? 0;

    $marginMudharabah = $db->table('mudharabah')
        ->where('status', 'aktif')
        ->where('MONTH(tanggal)', $bulanIni)
        ->where('YEAR(tanggal)', $tahunIni)
        ->selectSum('jml_terbayar')
        ->get()->getRow()->jumlah ?? 0;
---
SELECT SUM(`jml_terbayar`) AS `jml_terbayar`
FROM `qard`
WHERE `status` = 'aktif'
AND MONTH(tanggal) = '11'
AND YEAR(tanggal) = '2025'
SELECT SUM(`jml_terbayar`) AS `jml_terbayar`
FROM `murabahah`
WHERE `status` = 'aktif'
AND MONTH(tanggal) = '11'
AND YEAR(tanggal) = '2025'
SELECT SUM(`jml_terbayar`) AS `jml_terbayar`
FROM `mudharabah`
WHERE `status` = 'aktif'
AND MONTH(tanggal) = '11'
AND YEAR(tanggal) = '2025'


    // =========================
    // Pending (yang udah ada)
    // =========================
    $pendingSimpananCount = $db->table('simpanan_sukarela')->where('status', 'pending')->countAllResults();
    $pendingCount = $this->userModel->where('role', 'anggota')
                                    ->where('status', 'pending')
                                    ->countAllResults();
    $pendingQard = $db->table('qard')->where('status', 'pending')->countAllResults();
    $pendingMurabahah = $db->table('murabahah')->where('status', 'pending')->countAllResults();
    $pendingMudharabah = $db->table('mudharabah')->where('status', 'pending')->countAllResults();
    $pendingPinjamanCount = $pendingQard + $pendingMurabahah + $pendingMudharabah;
    $pendingPembayaranCount = $db->table('pembayaran_pending')->where('status', 'pending')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `simpanan_sukarela`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'anggota'
AND `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `qard`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `murabahah`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `mudharabah`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `pembayaran_pending`
WHERE `status` = 'pending'

   public function members()
{
    $search = $this->request->getGet('search');
    $builder = $this->anggotaModel;

    if ($search) {
        $builder = $builder->like('nama_lengkap', $search)
                           ->orLike('no_ktp', $search);
    }
    $anggota = $builder->findAll();

    // Cari relasi antara anggota dan users
    $userModel = new \App\Models\UserModel();
    $users = $userModel->findAll();
---
SELECT *
FROM `anggota`
SELECT *
FROM `users`

   public function getSimpananList()
{
    $jenis = $this->request->getGet('jenis');
    $id_anggota = $this->request->getGet('id_anggota');
    $db = \Config\Database::connect();

    $result = [];

    try {
        // Jika "all", ambil semua jenis
        if ($jenis === 'all' || empty($jenis)) {
            // **SIMPANAN POKOK - FILTER jumlah > 0**
            $builderPokok = $db->table('simpanan_pokok')
                ->select('simpanan_pokok.*, anggota.nama_lengkap, "pokok" as jenis')
                ->join('anggota', 'anggota.id_anggota = simpanan_pokok.id_anggota')
                ->where('simpanan_pokok.jumlah >', 0);  // **FILTER PENTING**

            if ($id_anggota && $id_anggota !== 'all') {
                $builderPokok->where('simpanan_pokok.id_anggota', $id_anggota);
            }
            $pokok = $builderPokok->get()->getResultArray();

            // **SIMPANAN WAJIB - tanpa filter jumlah**
            $builderWajib = $db->table('simpanan_wajib')
                ->select('simpanan_wajib.*, anggota.nama_lengkap, "wajib" as jenis')
                ->join('anggota', 'anggota.id_anggota = simpanan_wajib.id_anggota');

            if ($id_anggota && $id_anggota !== 'all') {
                $builderWajib->where('simpanan_wajib.id_anggota', $id_anggota);
            }
            $wajib = $builderWajib->get()->getResultArray();
---
SELECT `simpanan_pokok`.*, `anggota`.`nama_lengkap`, "pokok" as `jenis`
FROM `simpanan_pokok`
JOIN `anggota` ON `anggota`.`id_anggota` = `simpanan_pokok`.`id_anggota`
WHERE `simpanan_pokok`.`jumlah` > 0
AND `simpanan_pokok`.`id_anggota` = '46'
SELECT `simpanan_wajib`.*, `anggota`.`nama_lengkap`, "wajib" as `jenis`
FROM `simpanan_wajib`
JOIN `anggota` ON `anggota`.`id_anggota` = `simpanan_wajib`.`id_anggota`
WHERE `simpanan_wajib`.`id_anggota` = '46'