app/Controllers/AdminPendingPinjaman.php

SELECT `qard`.*, `anggota`.`nama_lengkap`, `anggota`.`nomor_anggota`, `anggota`.`jenis_bank`, `anggota`.`no_rek`, `anggota`.`atasnama_rekening`, `anggota`.`no_hp`, `anggota`.`email`, `anggota`.`alamat`
FROM `qard`
JOIN `anggota` ON `anggota`.`id_anggota` = `qard`.`id_anggota`
WHERE `qard`.`id_qard` = '25'
---
    public function detail($jenis, $id)
    {
        $db = \Config\Database::connect();
        $data = [];

        if ($jenis == 'qard') {
            $data = $db->table('qard')
                ->join('anggota', 'anggota.id_anggota = qard.id_anggota')
                ->select('qard.*, anggota.nama_lengkap, anggota.nomor_anggota,
                         anggota.jenis_bank, anggota.no_rek, anggota.atasnama_rekening,
                         anggota.no_hp, anggota.email, anggota.alamat')
                ->where('qard.id_qard', $id)
                ->get()->getRowArray();