app/Controllers/AdminDashboard.php

SELECT COUNT(*) AS `numrows`
FROM `simpanan_pokok`
WHERE `status` = 'pending'
---
        // Pending (yang udah ada)
        // =========================
        $pendingSimpananCount = $db->table('simpanan_sukarela')->where('status', 'pending')->countAllResults();
        $pendingSimpananPokokCount = $db->table('simpanan_pokok')->where('status', 'pending')->countAllResults(); // TAMBAHKAN INI