app/Controllers/Auth.php

    public function doLogin()
{
    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');

    $userModel = new UserModel();
    $user = $userModel->where('username', $username)->first();

    if ($user) {
        if (password_verify($password, $user['password'])) {

            if ($user['role'] == 'anggota' && $user['status'] != 'verified') {
                session()->setFlashdata('error', 'Akun Anda belum disetujui admin.');
                return redirect()->back()->withInput();
            }

            // Ambil data anggota
            $anggotaModel = new \App\Models\AnggotaModel();
            $anggota = $anggotaModel->where('id_anggota', $user['id'])->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin_koperasi'
 LIMIT 1
SELECT *
FROM `anggota`
WHERE `id_anggota` = '1'
 LIMIT 1