app/Controllers/Cicilan.php

SELECT *
FROM `anggota`
WHERE `anggota`.`id_anggota` = '46'
---
   public function index()
{
    // Ambil data anggota dari session
   $id_anggota = session()->get('id');
    if (!$id_anggota) {
        $id_anggota = session()->get('id_anggota');
    }
    $db = \Config\Database::connect();


    // Untuk testing, jika tidak ada session, gunakan ID 1
    if (!$id_anggota) {
        $id_anggota = 1;
    }

    // Ambil data anggota
    $anggota = $this->anggotaModel->find($id_anggota);

SELECT *
FROM `pembayaran_pending`
WHERE `id_anggota` = '46'
AND `status` = 'pending'
ORDER BY `created_at` DESC
SELECT *
FROM `pembayaran_pending`
WHERE `id_anggota` = '46'
AND `status` != 'pending'
ORDER BY `created_at` DESC
---
    $pembayaranPendingModel = new \App\Models\PembayaranPendingModel();

    // Ambil data pembayaran pending
    $pembayaran_pending = $pembayaranPendingModel->where('id_anggota', $id_anggota)
                                                ->where('status', 'pending')
                                                ->orderBy('created_at', 'DESC')
                                                ->findAll();

    // Ambil riwayat pembayaran - GUNAKAN QUERY MANUAL DULU
    $riwayat_pembayaran = $pembayaranPendingModel->where('id_anggota', $id_anggota)
                                                ->where('status !=', 'pending')
                                                ->orderBy('created_at', 'DESC')
                                                ->findAll();

SELECT `tenor`
FROM `simpanan_pokok`
WHERE `id_anggota` = '46'
---
    $summary = $this->getSummaryCicilan($pinjaman_aktif);

        // Cek tenor simpanan pokok anggota
        $tenorData = $db->table('simpanan_pokok')
            ->select('tenor')
            ->where('id_anggota', $id_anggota)
            ->get()
            ->getRowArray();

SELECT *
FROM `qard`
WHERE `id_anggota` = '46'
AND `status` = 'aktif'
---
private function getAllPinjamanAktif($id_anggota)
{
    $pinjaman_aktif = [];

    try {
        log_message('debug', '=== DEBUG DETAIL: MENGAMBIL PINJAMAN AKTIF ===');
        log_message('debug', 'ID Anggota: ' . $id_anggota);

        $db = \Config\Database::connect();

        // 1. Ambil dari tabel QARD
        $qard_aktif = $db->table('qard')
                        ->where('id_anggota', $id_anggota)
                        ->where('status', 'aktif')
                        ->get()
                        ->getResult();

SELECT *
FROM `murabahah`
WHERE `id_anggota` = '46'
AND `status` = 'aktif'
---


        // 2. Ambil dari tabel MURABAHAH
        $murabahah_aktif = $db->table('murabahah')
                             ->where('id_anggota', $id_anggota)
                             ->where('status', 'aktif')
                             ->get()
                             ->getResult();

SELECT *
FROM `mudharabah`
WHERE `id_anggota` = '46'
AND `status` = 'aktif'
---
        }

        // 3. Ambil dari tabel MUDHARABAH
        $mudharabah_aktif = $db->table('mudharabah')
                              ->where('id_anggota', $id_anggota)
                              ->where('status', 'aktif')
                              ->get()
                              ->getResult();

SELECT *
FROM `qard`
WHERE `id_anggota` = '46'
AND `status` = 'lunas'
---
    private function getAllPinjamanLunas($id_anggota)
{
    $pinjaman_lunas = [];

    try {
        log_message('debug', '=== MENGAMBIL PINJAMAN LUNAS DARI 3 TABEL ===');

        $db = \Config\Database::connect();

        // 1. Ambil dari tabel QARD yang lunas
        $qard_lunas = $db->table('qard')
                        ->where('id_anggota', $id_anggota)
                        ->where('status', 'lunas')
                        ->get()
                        ->getResult();

SELECT *
FROM `murabahah`
WHERE `id_anggota` = '46'
AND `status` = 'lunas'
---
        }

        // 2. Ambil dari tabel MURABAHAH yang lunas
        $murabahah_lunas = $db->table('murabahah')
                             ->where('id_anggota', $id_anggota)
                             ->where('status', 'lunas')
                             ->get()
                             ->getResult();

SELECT *
FROM `mudharabah`
WHERE `id_anggota` = '46'
AND `status` = 'lunas'
---
        }

        // 3. Ambil dari tabel MUDHARABAH yang lunas
        $mudharabah_lunas = $db->table('mudharabah')
                              ->where('id_anggota', $id_anggota)
                              ->where('status', 'lunas')
                              ->get()
                              ->getResult();