app/Controllers/Dashboard.php

    public function index()
    {
        $session = session();
        $id_anggota = $session->get('id_anggota');

        if (!$id_anggota) {
            return redirect()->to('/login');
        }

        $anggotaModel = new AnggotaModel();
        $anggota = $anggotaModel->find($id_anggota);

        $db = \Config\Database::connect();

        // Daftar status transaksi simpanan yang dianggap sah/ACC
        $statusValid = ['aktif', 'lunas', 'approved', 'disetujui'];

        // 1. SIMPANAN POKOK (Hanya hitung transaksi yang sah)
        $sim_pokok = (float)($db->table('simpanan_pokok')
            ->where('id_anggota', $id_anggota)
            ->whereIn('status', $statusValid)
            ->selectSum('jumlah')
            ->get()->getRow()->jumlah ?? 0);

        // 2. SIMPANAN WAJIB (Hanya hitung transaksi yang sah)
        $sim_wajib = (float)($db->table('simpanan_wajib')
            ->where('id_anggota', $id_anggota)
            ->whereIn('status', $statusValid)
            ->selectSum('jumlah')
            ->get()->getRow()->jumlah ?? 0);

        // 3. SIMPANAN SUKARELA (Hanya hitung transaksi yang sah)
        $sim_sukarela = (float)($db->table('simpanan_sukarela')
            ->where('id_anggota', $id_anggota)
            ->whereIn('status', $statusValid)
            ->selectSum('jumlah')
            ->get()->getRow()->jumlah ?? 0);
---
SELECT *
FROM `anggota`
WHERE `anggota`.`id_anggota` = '46'
SELECT SUM(`jumlah`) AS `jumlah`
FROM `simpanan_pokok`
WHERE `id_anggota` = '46'
AND `status` IN ('aktif','lunas','approved','disetujui')
SELECT SUM(`jumlah`) AS `jumlah`
FROM `simpanan_wajib`
WHERE `id_anggota` = '46'
AND `status` IN ('aktif','lunas','approved','disetujui')
SELECT SUM(`jumlah`) AS `jumlah`
FROM `simpanan_sukarela`
WHERE `id_anggota` = '46'
AND `status` IN ('aktif','lunas','approved','disetujui')

        $total_saldo = $sim_pokok + $sim_wajib + $sim_sukarela;

        // 4. RINCIAN PINJAMAN (Hanya Status Aktif)
        $pinj_qard = $db->table('qard')
            ->where('id_anggota', $id_anggota)
            ->where('status', 'aktif')
            ->selectSum('jml_pinjam')
            ->selectSum('jml_terbayar')
            ->get()->getRow();

        $pinj_murabahah = $db->table('murabahah')
            ->where('id_anggota', $id_anggota)
            ->where('status', 'aktif')
            ->selectSum('jml_pinjam')
            ->selectSum('jml_terbayar')
            ->get()->getRow();

        $pinj_mudharabah = $db->table('mudharabah')
            ->where('id_anggota', $id_anggota)
            ->where('status', 'aktif')
            ->selectSum('jml_pinjam')
            ->selectSum('jml_terbayar')
            ->get()->getRow();
---
SELECT SUM(`jml_pinjam`) AS `jml_pinjam`, SUM(`jml_terbayar`) AS `jml_terbayar`
FROM `qard`
WHERE `id_anggota` = '46'
AND `status` = 'aktif'
SELECT SUM(`jml_pinjam`) AS `jml_pinjam`, SUM(`jml_terbayar`) AS `jml_terbayar`
FROM `murabahah`
WHERE `id_anggota` = '46'
AND `status` = 'aktif'
SELECT SUM(`jml_pinjam`) AS `jml_pinjam`, SUM(`jml_terbayar`) AS `jml_terbayar`
FROM `mudharabah`
WHERE `id_anggota` = '46'
AND `status` = 'aktif'