app/Controllers/Dashboard.php

            ->selectSum('jml_pinjam')
            ->get()->getRow()->jml_pinjam ?? 0;

        $total_murabahah = $db->table('murabahah')
            ->where('id_anggota', $id_anggota)
            ->where('status', 'aktif')
            ->selectSum('jml_pinjam')
            ->get()->getRow()->jml_pinjam ?? 0;

        $total_mudharabah = $db->table('mudharabah')
            ->where('id_anggota', $id_anggota)
            ->where('status', 'aktif')
            ->selectSum('jml_pinjam')
            ->get()->getRow()->jml_pinjam ?? 0;
---
SELECT SUM(`jml_pinjam`) AS `jml_pinjam`
FROM `murabahah`
WHERE `id_anggota` = '45'
AND `status` = 'aktif'
SELECT SUM(`jml_pinjam`) AS `jml_pinjam`
FROM `mudharabah`
WHERE `id_anggota` = '45'
AND `status` = 'aktif'