app/Controllers/Pinjaman.php

SELECT *
FROM `users`
WHERE `users`.`id` = '40'
SELECT *
FROM `anggota`
WHERE `anggota`.`id_anggota` = '40'
SELECT `tenor`
FROM `simpanan_pokok`
WHERE `id_anggota` = '40'
---
    public function index()
    {
        $session = session();
        $id_user = $session->get('id');
        $db = \Config\Database::connect();

        $userModel = new UserModel();
        $anggotaModel = new AnggotaModel();

        $user = $userModel->find($id_user);
        $anggota = $anggotaModel->find($id_user);

        // Ambil nama dari anggota_lengkap jika ada, jika tidak pakai user
        $nama = $anggota['nama_lengkap'] ?? $user['nama_lengkap'] ?? '-';
        $nomor_anggota = $anggota['nomor_anggota'] ?? $user['id'] ?? '-';

        $hasNoRekening = !empty($anggota['no_rek']);
        $loanStatus = $this->getLoanStatusDetail($id_user); // Cek status 'pending', 'aktif', atau 'none'
        $hasActiveLoan = ($loanStatus !== 'none');
        $pendingLoansCount = $this->getPendingLoans($id_user);

        // Cek tenor simpanan pokok anggota
        $tenorData = $db->table('simpanan_pokok')
            ->select('tenor')
            ->where('id_anggota', $id_user)
            ->get()
            ->getRowArray();

SELECT *
FROM `user_pin`
WHERE `user_id` = '40'
---

        // CEK APAKAH SUDAH BUAT PIN
        $hasPin = false;
        $pinData = $db->table('user_pin')
            ->where('user_id', $id_user)
            ->get()
            ->getRowArray();

INSERT INTO `qard` (`id_anggota`, `jml_pinjam`, `jml_angsuran`, `deskripsi`, `tanggal`, `status`) VALUES ('40', '100000', '1', 'ydryryeryey', '2025-12-24', 'pending')
---

        try {
            if ($jenis == 'qard') {
                $db->table('qard')->insert([
                    'id_anggota' => $id_user,
                    'jml_pinjam' => $jumlah,
                    'jml_angsuran' => $lama_cicilan,
                    'deskripsi' => $deskripsi,
                    'tanggal' => date('Y-m-d'),
                    'status' => 'pending'
                ]);

SELECT COUNT(*) AS `numrows`
FROM `qard`
WHERE `id_anggota` = '40'
AND `status` = 'aktif'
SELECT COUNT(*) AS `numrows`
FROM `mudharabah`
WHERE `id_anggota` = '40'
AND `status` = 'aktif'
SELECT COUNT(*) AS `numrows`
FROM `murabahah`
WHERE `id_anggota` = '40'
AND `status` = 'aktif'
---
    private function hasActiveLoan($id_anggota)
    {
        $db = \Config\Database::connect();

        $qard = $db->table('qard')
            ->where('id_anggota', $id_anggota)
            ->whereIn('status', ['aktif', 'pending', 'menunggu'])
            ->countAllResults();

        $murabahah = $db->table('murabahah')
            ->where('id_anggota', $id_anggota)
            ->whereIn('status', ['aktif', 'pending', 'menunggu'])
            ->countAllResults();

        $mudharabah = $db->table('mudharabah')
            ->where('id_anggota', $id_anggota)
            ->whereIn('status', ['aktif', 'pending', 'menunggu'])
            ->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `qard`
WHERE `id_anggota` = '40'
AND `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `mudharabah`
WHERE `id_anggota` = '40'
AND `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `murabahah`
WHERE `id_anggota` = '40'
AND `status` = 'pending'
---
    private function getPendingLoans($id_anggota)
    {
        $db = \Config\Database::connect();

        $qard = $db->table('qard')
            ->where('id_anggota', $id_anggota)
            ->whereIn('status', ['pending', 'menunggu'])
            ->countAllResults();

        $murabahah = $db->table('murabahah')
            ->where('id_anggota', $id_anggota)
            ->whereIn('status', ['pending', 'menunggu'])
            ->countAllResults();

        $mudharabah = $db->table('mudharabah')
            ->where('id_anggota', $id_anggota)
            ->whereIn('status', ['pending', 'menunggu'])
            ->countAllResults();

SELECT *
FROM `user_pin`
WHERE `user_id` = '40'
---
    private function verifyPin($user_id, $pin_input)
    {
        $db = \Config\Database::connect();

        $pinData = $db->table('user_pin')
            ->where('user_id', $user_id)
            ->get()
            ->getRowArray();