app/Controllers/Profil.php

    public function index()
    {
        $session = session();
        $id = $session->get('id');
        $anggotaModel = new AnggotaModel();

        $anggota = $anggotaModel->find($id);
---
SELECT *
FROM `anggota`
WHERE `anggota`.`id_anggota` = '60'