app/Controllers/Simpanan.php

    public function index()
    {
        $session = session();
        $id_anggota = $session->get('id');

        $db = \Config\Database::connect();

        // Ambil data anggota
        $anggota = $db->table('anggota')
            ->select('id_anggota, nama_lengkap, nomor_anggota, photo')
            ->where('id_anggota', $id_anggota)
            ->get()
            ->getRowArray();

        // **AMBIL TENOR DARI SIMPANAN_POKOK**
        $tenorData = $db->table('simpanan_pokok')
            ->select('tenor')
            ->where('id_anggota', $id_anggota)
            ->get()
            ->getRowArray();

        // **FILTER: hanya ambil simpanan pokok yang jumlah > 0**
        $pokok = $db->table('simpanan_pokok')
            ->where('id_anggota', $id_anggota)
            ->where('jumlah >', 0) // **INI YANG PENTING**
            ->orderBy('tanggal', 'ASC')
            ->get()->getResultArray();

        // Simpanan Wajib
        $wajib = $db->table('simpanan_wajib')
            ->where('id_anggota', $id_anggota)
            ->orderBy('tanggal', 'ASC')
            ->get()->getResultArray();

        // Simpanan Sukarela
        $sukarela = $db->table('simpanan_sukarela')
            ->where('id_anggota', $id_anggota)
            ->orderBy('tanggal', 'DESC')
            ->get()->getResultArray();
---
SELECT `id_anggota`, `nama_lengkap`, `nomor_anggota`, `photo`
FROM `anggota`
WHERE `id_anggota` = '60'
SELECT `tenor`
FROM `simpanan_pokok`
WHERE `id_anggota` = '60'
SELECT *
FROM `simpanan_pokok`
WHERE `id_anggota` = '60'
AND `jumlah` > 0
ORDER BY `tanggal` ASC
SELECT *
FROM `simpanan_wajib`
WHERE `id_anggota` = '60'
ORDER BY `tanggal` ASC
SELECT *
FROM `simpanan_sukarela`
WHERE `id_anggota` = '60'
ORDER BY `tanggal` DESC