app/Models/MudharabahModel.php

SELECT `mudharabah`.*, `anggota`.`nama_lengkap`, `anggota`.`no_ktp`, `anggota`.`nomor_anggota`
FROM `mudharabah`
JOIN `anggota` ON `anggota`.`id_anggota` = `mudharabah`.`id_anggota`
---
     public function getAngsuranWithAnggota()
    {
        // ✅ SESUAIKAN DENGAN FIELD YANG ADA DI TABEL ANGGOTA
        return $this->select('mudharabah.*, anggota.nama_lengkap, anggota.no_ktp, anggota.nomor_anggota')
                    ->join('anggota', 'anggota.id_anggota = mudharabah.id_anggota')
                    ->findAll();