app/Models/MurabahahModel.php

SELECT `murabahah`.*, `anggota`.`nama_lengkap`, `anggota`.`no_ktp`, `anggota`.`nomor_anggota`
FROM `murabahah`
JOIN `anggota` ON `anggota`.`id_anggota` = `murabahah`.`id_anggota`
---
    public function getAngsuranWithAnggota()
    {
        // ✅ SESUAIKAN DENGAN FIELD YANG ADA DI TABEL ANGGOTA
        return $this->select('murabahah.*, anggota.nama_lengkap, anggota.no_ktp, anggota.nomor_anggota')
                    ->join('anggota', 'anggota.id_anggota = murabahah.id_anggota')
                    ->findAll();