app/Models/QardModel.php

SELECT `qard`.*, `anggota`.`nama_lengkap`, `anggota`.`nomor_anggota`
FROM `qard`
JOIN `anggota` ON `anggota`.`id_anggota` = `qard`.`id_anggota`
---
      public function getAngsuranWithAnggota()
{
    return $this->select('qard.*, anggota.nama_lengkap, anggota.nomor_anggota')
                ->join('anggota', 'anggota.id_anggota = qard.id_anggota')
                ->findAll();